const UPDATE_LOG = [
  {
    "title": "2021년 9월",
    "log": [
      {
        "title": "9월 13일",
        "log": [
          {
            "title": "캐릭터의 알파값을 낮췄습니다. 이제 캐릭터가 밟고 있는 칸의 숫자 힌트를 볼 수 있습니다.",
            "log": []
          },
          {
            "title": "R키의 효과가 이제 더 이상 매 스테이지마다 초기화되지 않습니다.",
            "log": []
          },
          {
            "title": "R키의 효과가 이제 더 이상 색깔 표시에 가려지지 않습니다.",
            "log": []
          },
          {
            "title": "하단 바에 남은 지뢰 개수가 추가되었습니다.",
            "log": [
              "남은 지뢰 개수는 (현재 공개된 지뢰 개수)/(게임판 전체 지뢰 개수)로 표시됩니다.",
              "현재 공개된 지뢰 개수는 지뢰가 표시된 칸과 마우스 클릭으로 빨간색 색깔 표시를 한 칸 개수의 합과 같습니다."
            ]
          },
          {
            "title": "제한 시간이 30초 남았음을 알리는 효과음이 추가되었습니다.",
            "log": []
          }
        ]
      },

      {
        "title": "9월 15일 - 1",
        "log": [
          {
            "title": "순위표가 110등에서 더 이상 넘어가지 않던 버그를 수정하였습니다.",
            "log": []
          },
          {
            "title": "STAGE 14 클리어 후 3번 아이템(📡)이 3개 지급되던 버그를 수정하였습니다.",
            "log": []
          },
          {
            "title": "STAGE 20과 STAGE 30 클리어 보너스를 조정하였습니다.",
            "log": [
              "STAGE 20 보너스 🔭 +3 → 🔭 +4, 📡 +2 → 📡 +3",
              "STAGE 30 보너스 🔭 +2 → 🔭 +3, 📡 +1 → 📡 +2",
              "위에서 언급한 3번 아이템 지급 버그 때문에 이전 버전과 형평성을 맞추기 위해 보너스를 조정하였습니다."
            ]
          },
          {
            "title": "공백만으로 이름을 지을 수 있던 버그를 수정하였습니다.",
            "log": []
          },
          {
            "title": "STAGE 45 클리어 화면을 수정하였습니다.",
            "log": []
          },
          {
            "title": "메인 화면에 패치노트 버튼을 추가하였습니다.",
            "log": []
          },
          {
            "title": "기존의 게임을 [ 클래식 모드 ]로 명명하고, 새로운 모드인 [ 도전 모드 ]가 추가되었습니다.",
            "log": [
              "추가된 모드인 도전 모드는 단 하나의 목숨으로 아이템 없이 진행되는 모드입니다.",
              "도전 모드는 각각의 맵 하나만을 플레이하며, 맵별로 순위표에 점수가 기록됩니다.",
              "현재는 1개의 맵만 추가되었으며, 앞으로 계속 추가할 예정입니다."
            ]
          }
        ]
      },

      {
        "title": "9월 15일 - 2 긴급 패치",
        "log": [
          {
            "title": "이전 패치가 적용되지 않은 상태로 플레이하면 기록이 저장되지 않는 버그를 수정했습니다.",
            "log": [
              "새벽 시간대에 패치를 진행했으나, 패치 진행 도중에 플레이 중인 일부 유저분들의 점수가 저장되지 않았습니다.",
              "앞으로는 패치를 진행하여도 패치 이전에 플레이 중이던 유저의 점수가 누락되지 않도록 하겠습니다.",
              "금일 새벽 1시 ~ 2시 경 플레이 중이던 유저분들께 불편을 끼쳐드려 진심으로 사과의 말씀 드립니다."
            ]
          },
          {
            "title": "약간의 UI가 변경되었습니다.",
            "log": []
          }
        ]
      }

    ]
  }
];